Revit 2027 API
BuiltInFailures.CutFailures.HostCutoutForInsertionFailure Property
 Can't cut host for inserted objects
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostCutoutForInsertionFailure { get; }
Public Shared ReadOnly Property HostCutoutForInsertionFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostCutoutForInsertionFailure {
	FailureDefinitionId^ get ();
}
static member HostCutoutForInsertionFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace